siak1m/nrf51dk-squarewave/main.c
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for placing the application in low power state while waiting for events.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

/**
 * @brief ADC interrupt handler.
 * Prints ADC results on hardware UART and over BLE via the NUS service.
 */
static void adc_event_handler_original(nrf_drv_adc_evt_t const * p_event)
{
    uint8_t adc_result[ADC_BUFFER_SIZE*2];
	
    if (p_event->type == NRF_DRV_ADC_EVT_DONE)
    {
        adc_event_counter++;
        printf("    ADC event counter: %d\r\n", adc_event_counter);			
        uint32_t i;
        for (i = 0; i < p_event->data.done.size; i++)
        {
            printf("Sample value %d: %d\r\n", (unsigned int)i+1, p_event->data.done.p_buffer[i]);   //Print ADC result on hardware UART
            adc_result[(i*2)] = p_event->data.done.p_buffer[i] >> 8;
            adc_result[(i*2)+1] = p_event->data.done.p_buffer[i];					
        }
        if(ADC_BUFFER_SIZE <= 10)
        {
            ble_nus_string_send(&m_nus, &adc_result[0], ADC_BUFFER_SIZE*2);           //Send ADC result over BLE via NUS service
        }		
        LEDS_INVERT(BSP_LED_3_MASK);				                                          //Indicate sampling complete on LED 4
    }
}

static void adc_event_handler(nrf_drv_adc_evt_t const * p_event)
{
    uint8_t adc_result[ADC_BUFFER_SIZE*2];
	
    if (p_event->type == NRF_DRV_ADC_EVT_DONE)
    {
        adc_event_counter++;
        printf("    ADC event counter: %d\r\n", adc_event_counter);			
        uint32_t i;
        for (i = 0; i < p_event->data.done.size; i++)
        {
            printf("Sample value %d: %d\r\n", (i%number_of_adc_channels), p_event->data.done.p_buffer[i]);   //Print ADC result on hardware UART
            adc_result[(i*2)] = p_event->data.done.p_buffer[i] >> 8;
            adc_result[(i*2)+1] = p_event->data.done.p_buffer[i];					
        }
        if(ADC_BUFFER_SIZE <= 10)
        {
					ble_nus_string_send(&m_nus, &adc_result[0], ADC_BUFFER_SIZE*2);           //Send ADC result over BLE via NUS service
				}		
        LEDS_INVERT(BSP_LED_3_MASK);				                                          //Indicate sampling complete on LED 4
    }
}

/**
 * @brief ADC initialization.
 */
static void adc_config_original(void)
{
    ret_code_t ret_code;
    nrf_drv_adc_config_t config = NRF_DRV_ADC_DEFAULT_CONFIG;

    ret_code = nrf_drv_adc_init(&config, adc_event_handler);
    APP_ERROR_CHECK(ret_code);

    nrf_drv_adc_channel_enable(&m_channel_config);
}

static void adc_config(void)
{
	ret_code_t ret_code;
	
	//Initialize ADC
	nrf_drv_adc_config_t config = NRF_DRV_ADC_DEFAULT_CONFIG;
	ret_code = nrf_drv_adc_init(&config, adc_event_handler);
	APP_ERROR_CHECK(ret_code);
	
	//Configure and enable ADC channel 0
	static nrf_drv_adc_channel_t m_channel_0_config = NRF_DRV_ADC_DEFAULT_CHANNEL(NRF_ADC_CONFIG_INPUT_2);
	m_channel_0_config.config.config.input = NRF_ADC_CONFIG_SCALING_INPUT_ONE_THIRD;
	nrf_drv_adc_channel_enable(&m_channel_0_config);
	
	//Configure and enable ADC channel 1
	static nrf_drv_adc_channel_t m_channel_1_config = NRF_DRV_ADC_DEFAULT_CHANNEL(NRF_ADC_CONFIG_INPUT_3);
	m_channel_1_config.config.config.input = NRF_ADC_CONFIG_SCALING_INPUT_ONE_THIRD;
	nrf_drv_adc_channel_enable(&m_channel_1_config);
	
	//Configure and enable ADC channe 2
	static nrf_drv_adc_channel_t m_channel_2_config = NRF_DRV_ADC_DEFAULT_CHANNEL(NRF_ADC_CONFIG_INPUT_4);
	m_channel_2_config.config.config.input = NRF_ADC_CONFIG_SCALING_INPUT_ONE_THIRD;
	nrf_drv_adc_channel_enable(&m_channel_2_config);
	
	number_of_adc_channels = 3; //Set equal to the number of configured ADC channels, for the sake of UART output
	
}

/**@breif Function for I2C
* I2C initialization
*/
//nrf51
//#define I2C_SCL_PIN        7
//#define I2C_SDA_PIN        30
//green chip
#define I2C_SCL_PIN        24
#define I2C_SDA_PIN        23

#define MPU_6050_I2C_ADDR    0X68     //MPU6050 I2C-ADRESS

/* MPU-6050 Register Map */
#define WHO_AM_I           0x75
#define ACCEL_XOUT_H       0x3B
#define TEMP_OUT_H         0x41    
#define GYRO_XOUT_H        0x43         
#define PWR_MGMT_1         0x6B

//TWI instance
static const nrf_drv_twi_t m_twi_mpu_6050 = NRF_DRV_TWI_INSTANCE(0);

//I2C
void twi_init(void)
{
	ret_code_t err_code;
	const nrf_drv_twi_config_t twi_mpu_6050_config = {
	  .scl = I2C_SCL_PIN,
		.sda = I2C_SDA_PIN,
		.frequency = NRF_TWI_FREQ_400K,
		.interrupt_priority = APP_IRQ_PRIORITY_HIGH
	};
  err_code = nrf_drv_twi_init(&m_twi_mpu_6050,&twi_mpu_6050_config,NULL,NULL);
	APP_ERROR_CHECK(err_code);
	
	nrf_drv_twi_enable(&m_twi_mpu_6050);
}
/**
* @breif Function for writing to registers on the MPU-6050.
*/
ret_code_t mpu_6050_I2C_register_write(uint8_t reg_addr, uint8_t*p_tx_data,uint8_t bytes)
{
	ret_code_t ret_code;
	
	uint8_t tx_data[bytes+1];
	
	tx_data[0] = reg_addr;
	
	for(uint8_t i = 0; i<bytes; i++)
	{
		tx_data[i+1] = p_tx_data[i];
	}
	
	ret_code = nrf_drv_twi_tx(&m_twi_mpu_6050,MPU_6050_I2C_ADDR, tx_data, sizeof(tx_data),false);
	
	return ret_code;
	
}

/**
* @breif Functin for reading from registers on the MPU-6050.
*/

ret_code_t mpu_6050_I2C_register_read(uint8_t reg_addr, uint8_t*p_rx_data,uint32_t bytes)
{
	ret_code_t ret_code;
	
	ret_code = nrf_drv_twi_tx(&m_twi_mpu_6050,MPU_6050_I2C_ADDR,&reg_addr,1,false);
	
	if(ret_code != NRF_SUCCESS)
	{
		return ret_code;
	}
	
	ret_code = nrf_drv_twi_rx(&m_twi_mpu_6050,MPU_6050_I2C_ADDR,p_rx_data,bytes);
	
	return ret_code;
	
}

/**@breif mpu6050 
*/

int16_t x_val;
int16_t y_val;
int16_t z_val;
int16_t x_gyro;
int16_t y_gyro;
int16_t z_gyro;
double temp_c;
//calibrated value
int16_t x_cal;
int16_t y_cal;
int16_t z_cal;

void mpu_6050_init(void)
{
	ret_code_t err_code;
	
	uint8_t tx_data = 0;
	
	//write zero to the PWR_MGMT_1 register to wake up the MPU-6050
	err_code = mpu_6050_I2C_register_write(PWR_MGMT_1,&tx_data,1);
	
	APP_ERROR_CHECK(err_code);
}

void mpu_6050_get_device_id(uint8_t*p_dev_id)
{
	ret_code_t err_code;
	
	uint8_t rx_data;
	
	//Read the I2C address of the mpu-6050 from the who-am-i register
	err_code = mpu_6050_I2C_register_read(WHO_AM_I,&rx_data,1);
	
	APP_ERROR_CHECK(err_code);
	
