siak1m/nrf51dk-squarewave/main.c
	*p_dev_id = rx_data;
	
}

void mpu_6050_read_acc(int16_t*p_x_val,int16_t*p_y_val,int16_t*p_z_val)
{
	ret_code_t err_code;
	
	//Raw accelerometer measurements buffer
	uint8_t acc_data[6];
	
	//Read the six accelerometer data registers starting from ACCEL_XOUT_H
	err_code = mpu_6050_I2C_register_read(ACCEL_XOUT_H,acc_data,sizeof(acc_data));
	
	APP_ERROR_CHECK(err_code);
	
	/*Combine the two 8-bit data registers to a 16-bit value for each axis by left shifting ACCEL_Xout_h
	eight times and or it with accel_xout_l.*/
	*p_x_val = (acc_data[0]<<8)|acc_data[1];
	*p_y_val = (acc_data[2]<<8)|acc_data[3];
	*p_z_val = (acc_data[4]<<8)|acc_data[5];

}
void mpu_6050_read_gyro(int16_t * p_x_gyro, int16_t * p_y_gyro, int16_t * p_z_gyro)
{
    ret_code_t err_code;
    
    uint8_t gyro_data[6];
    
    //Read the 6 gyroscope data registers starting from GYRO_XOUT_H
    err_code = mpu_6050_I2C_register_read(GYRO_XOUT_H, gyro_data, sizeof(gyro_data));
    
    APP_ERROR_CHECK(err_code);
    
    /*  Combine the two 8-bit data registers to a 16-bit value
        for each axis by left shifting GYRO_xOUT_H eight times 
        and OR it with GYRO_xOUT_L. */
    *p_x_gyro = (gyro_data[0]<<8)|gyro_data[1];
    *p_y_gyro = (gyro_data[2]<<8)|gyro_data[3];
    *p_z_gyro = (gyro_data[4]<<8)|gyro_data[5];
}
	
void mpu_6050_read_temp(double*p_temp)
{
	ret_code_t err_code;
	
	//signed 16-bit integer to store the meaurements
	int16_t temp;
	
	//Raw temperature measurements buffer
	uint8_t temp_data[2];
	
	//Read the two temperature data registers starting from TEMP_OUT_H
	err_code = mpu_6050_I2C_register_read(GYRO_XOUT_H, temp_data,sizeof(temp_data));
	
	APP_ERROR_CHECK(err_code);
	
	/*Combine the two 8-bit data registers to a 16-bit value
	  for each axis by left shiffing TEMP_OUT_H eight tiems 
	  and OR it with TEMP_OUT_L.*/
	temp = (temp_data[0]<<8)|temp_data[1];
	
	/*Convert raw measurement to degress C using formula from TEMP_OUT_H
	  register description 
	  in MPU-6050 Register Map and Descriptions document*/
		
		*p_temp = (temp/340.0)+36.53;
	
}

/**@breif calibration for mpu6050 
*
*/

int buffersize=1000;
int acel_deadzone=8;     //Acelerometer error allowed, make it lower to get more precision, but sketch may not converge  (default:8)
int giro_deadzone=1;
/*
 * Values we prefer to read from sensors in each axes when placing the device horizontally, package letters facing
 * up, without any movement.
 *
 * The goal values for all sensors in each axes are 0, except for z axis of accelerometer. The goal value for z
 * axis of accelerometer is 16384, meaning +1 g, indicating the object is under gravity.
 */
const int16_t acc_x_goal = 0;
const int16_t acc_y_goal = 0;
const int16_t acc_z_goal = 16384;
const int16_t gyro_x_goal = 0;
const int16_t gyro_y_goal = 0;
const int16_t gyro_z_goal = 0;

int mean_ax,mean_ay,mean_az,mean_gx,mean_gy,mean_gz,state=0;
int ax_offset,ay_offset,az_offset,gx_offset,gy_offset,gz_offset;
int ax_cali,ay_cali,az_cali;

void calibration()
{
	long i=0,buff_ax=0,buff_ay=0,buff_az=0,buff_gx=0,buff_gy=0,buff_gz=0;
	
	while(i<(buffersize+101))
	{
		//read raw accel/gyro measurements from device
		mpu_6050_read_acc(&x_val,&y_val,&z_val);
		mpu_6050_read_gyro(&x_gyro,&y_gyro,&z_gyro);
		
		if(i>100 && i<=(buffersize+100))
			{ //First 100 measures are discarded
				buff_ax=buff_ax+x_val;
				buff_ay=buff_ay+y_val;
				buff_az=buff_az+z_val;
				buff_gx=buff_gx+x_gyro;
				buff_gy=buff_gy+y_gyro;
				buff_gz=buff_gz+z_gyro;			
	    }
		if(i==(buffersize+100))
    {
			mean_ax=buff_ax/buffersize;
			mean_ay=buff_ay/buffersize;
      mean_az=buff_az/buffersize;
      mean_gx=buff_gx/buffersize;
      mean_gy=buff_gy/buffersize;
      mean_gz=buff_gz/buffersize;
			printf("MEAN accel x : %d, y:%d,Z:%d \r\n",mean_ax,mean_ay,mean_az);
			
			ax_offset=-mean_ax/8;
	    ay_offset=-mean_ay/8;
	    az_offset=(16384-mean_az)/8;
	
	    gx_offset=-mean_gx/4;
	    gy_offset=-mean_gy/4;
	    gz_offset=-mean_gz/4;
		  printf("offset accel x : %d, y:%d,Z:%d \r\n",ax_offset,ay_offset,az_offset);
		}
		i++;

	}
}


void calibration_x()
{
	ax_offset=-mean_ax/8;
	ay_offset=-mean_ay/8;
	az_offset=(16384-mean_az)/8;
	
	gx_offset=-mean_gx/4;
	gy_offset=-mean_gy/4;
	gz_offset=-mean_gz/4;
	
	printf("offset accel x : %d, y:%d,Z:%d \r\n",ax_offset,ay_offset,az_offset);
	
	while(1)
  {
		int ready=0;
		
		
		//meansensors();
		
		
		 if (abs(mean_ax)<=acel_deadzone) ready++;
    else ax_offset=ax_offset-mean_ax/acel_deadzone;

    if (abs(mean_ay)<=acel_deadzone) ready++;
    else ay_offset=ay_offset-mean_ay/acel_deadzone;

    if (abs(16384-mean_az)<=acel_deadzone) ready++;
    else az_offset=az_offset+(16384-mean_az)/acel_deadzone;

    if (abs(mean_gx)<=giro_deadzone) ready++;
    else gx_offset=gx_offset-mean_gx/(giro_deadzone+1);

    if (abs(mean_gy)<=giro_deadzone) ready++;
    else gy_offset=gy_offset-mean_gy/(giro_deadzone+1);

    if (abs(mean_gz)<=giro_deadzone) ready++;
    else gz_offset=gz_offset-mean_gz/(giro_deadzone+1);

    if (ready==6) 
		printf("mean accel x : %d, y:%d,Z:%d \r\n",ax_offset,ay_offset,az_offset);
		break;
		 
	}
	
}
int detection;

void posture()
{
	if(ax_cali<=0 && ay_cali <=-1 && az_cali==0)
   {
		 detection = 0; //person lying on left side
	 }
	 if(ax_cali ==0 && ay_cali == 3 && az_cali<=0)
   {
		 detection = 1; //person lying on right side
	 }
	 if(ax_cali ==0 && ay_cali == 0 && az_cali>=2)
	 {
		 detection = 2; //upright posture lying posture
	 }
	 if(ax_cali == -3 && ay_cali ==0 && az_cali<=0)
	 {
		 detection = 3; // upright posture
	 }
	 

}


/**@breif timer to interrupt
*/
void start_timer2(void)
{
	//NRF_TIMER2->MODE = TIMER_MODE_MODE_Counter;         //counter_mode
	NRF_TIMER2->MODE = TIMER_MODE_MODE_Timer;            //timer mode
	NRF_TIMER2->TASKS_CLEAR = 1;                          //clear time
	NRF_TIMER2->PRESCALER =9;                            // Set presclaser. Higher number gives slower timer.     
	NRF_TIMER2->BITMODE = TIMER_BITMODE_BITMODE_16Bit;    //Set counter to 16 bit resolutin
	NRF_TIMER2->CC[0] = 0;                              //Set vlaue for Timer2 comapre register 0 //1 second = 31250
	NRF_TIMER2->CC[1] = 990;                        	    //Set value for timer2 compare register 1
	//NRF_TIMER2->CC[2] = 31250;
	//NRF_TIMER2->CC[3] = 62500;
	//Enable interrupt on Timer2, both for CC[0] and CC[1] compare match events
	NRF_TIMER2->INTENSET = ( TIMER_INTENSET_COMPARE0_Enabled << TIMER_INTENSET_COMPARE0_Pos
	                       | TIMER_INTENSET_COMPARE1_Enabled << TIMER_INTENSET_COMPARE1_Pos
	                       | TIMER_INTENSET_COMPARE2_Enabled << TIMER_INTENSET_COMPARE2_Pos
	                       | TIMER_INTENSET_COMPARE3_Enabled << TIMER_INTENSET_COMPARE3_Pos
	                       );
	NVIC_EnableIRQ(TIMER2_IRQn);
	NRF_TIMER2->TASKS_START = 1;                         //Start Timer2
}
void TIMER2_IRQHandler(void)
{
	if((NRF_TIMER2->EVENTS_COMPARE[0] !=0 )&&((NRF_TIMER2->INTENSET & TIMER_INTENSET_COMPARE0_Msk) !=0))
	{ 
		NRF_TIMER2->EVENTS_COMPARE[0] = 0;
		APP_ERROR_CHECK(nrf_drv_adc_buffer_convert(adc_buffer,ADC_BUFFER_SIZE));   //Allocate buffer for ADC
        for (uint32_t i = 0; i < ADC_BUFFER_SIZE; i++)
        {
            nrf_drv_adc_sample();           // manually trigger ADC conversion
            power_manage();                 // CPU enter sleep mode during sampling. CPU will be enabled again when ADC interrupt occurs and adc_event_handler is called
            LEDS_INVERT(BSP_LED_1_MASK);    // Indicate sampling complete
            //nrf_delay_ms(250);              // Slow down sampling frequency with 250ms blocking delay
        }
		
	}
	if((NRF_TIMER2->EVENTS_COMPARE[1] !=0 ) &&((NRF_TIMER2->INTENSET & TIMER_INTENSET_COMPARE1_Msk) !=0))
	{ 
		NRF_TIMER2->EVENTS_COMPARE[1] = 0;
		calibration(); //for i2c mpu6050
		uint8_t str0[5];
		printf((char*)str0,"ax_cali,ay_cali,az_cali,detection: %d,%d,%d,%d\n",(int)ax_cali,(int)ay_cali,(int)az_cali,(int)detection);
	}}
	/*
	if((NRF_TIMER2->EVENTS_COMPARE[2] != 0) &&((NRF_TIMER2->INTENSET & TIMER_INTENSET_COMPARE2_Msk) !=0))
	{ 
		NRF_TIMER2->EVENTS_COMPARE[2] = 0;
		
	}
		
	if((NRF_TIMER2->EVENTS_COMPARE[3] != 0) &&((NRF_TIMER2->INTENSET & TIMER_INTENSET_COMPARE3_Msk) !=0))
	{ 
		NRF_TIMER2->EVENTS_COMPARE[3] = 0;
		
	}
	
}
*/

/**@brief Application main function.
 */
int main(void)
{
    uint32_t err_code;
    bool erase_bonds;

    // Initialize.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
    uart_init();

    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();

    printf("\r\nUART Start!\r\n");
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
    
	  //adc init
    adc_config();
	  
		//i2c init
		twi_init();
		mpu_6050_init();
		uint8_t device_id;
		mpu_6050_get_device_id(&device_id);
		printf("mpu6050 ID : %x \r\n",device_id);		

    // Enter main loop.
    for (;;)
    {
        start_timer2();
    }
}


/**
 * @}
 */
